Tekla Open API Reference for Tekla Structures 2025
DataFilterExpression Class
 The DataFilterExpression class represents a basic data type for a filter expression. This is a base class for other filter expressions and cannot be used directly.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Filtering.Expression
 Tekla.Structures.Filtering.DataFilterExpression
 More...
 Namespace: Tekla.Structures.Filtering
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public abstract class DataFilterExpression : Expression
<SerializableAttribute>
Public MustInherit Class DataFilterExpression
	Inherits Expression
The DataFilterExpression type exposes the following members.
Methods
Name | Description
ToString
 Creates a string representation of the current object.
 (Overrides Expression.ToString().)
Top
See Also
Reference
Tekla.Structures.Filtering Namespace
Inheritance Hierarchy
System.Object
 Tekla.Structures.Filtering.Expression
 Tekla.Structures.Filtering.DataFilterExpression
 Tekla.Structures.Filtering.BooleanConstantFilterExpression
 Tekla.Structures.Filtering.BooleanFilterExpression
 Tekla.Structures.Filtering.DateTimeConstantFilterExpression
 Tekla.Structures.Filtering.DateTimeFilterExpression
 Tekla.Structures.Filtering.NumericConstantFilterExpression
 Tekla.Structures.Filtering.NumericFilterExpression
 Tekla.Structures.Filtering.StringConstantFilterExpression
 Tekla.Structures.Filtering.StringFilterExpression